In [1]:
import pandas as pd
import pandas as pd
from sqlalchemy import create_engine
%load_ext sql

In [2]:
# Create a connection to the PostgreSQL database
engine=create_engine('postgresql+psycopg2://postgres:password@localhost:5432/medsupply')
connection=engine.connect()
print("Connected:", connection.closed == False)

Connected: True

In [3]:
# check connection using SQL magic command
%sql postgresql+psycopg2://postgres:password@localhost:5432/medsupply

'Connected: postgres@medsupply'

Check Column Name Length and Escaped Characters

In [4]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'customers'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('customer_id', 11, 'customer_id'),
 ('customer_name', 13, 'customer_name'),
 ('facility_type', 13, 'facility_type'),
 ('pic_name', 8, 'pic_name'),
 ('pic_phone', 9, 'pic_phone'),
 ('total_transaction', 17, 'total_transaction')]

In [5]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'master_products'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('product_code', 12, 'product_code'),
 ('product_name', 12, 'product_name'),
 ('product_type', 12, 'product_type'),
 ('stock_available', 15, 'stock_available'),
 ('inden_lead_time_days', 20, 'inden_lead_time_days'),
 ('supplier_cost', 13, 'supplier_cost')]

In [6]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'transactions_item'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
8 rows affected.

[('transaction_id', 14, 'transaction_id'),
 ('product_type', 12, 'product_type'),
 ('product_code', 12, 'product_code'),
 ('product_name', 12, 'product_name'),
 ('unit_price', 10, 'unit_price'),
 ('quantity', 8, 'quantity'),
 ('item_total', 10, 'item_total'),
 ('inden_status', 12, 'inden_status')]

In [7]:
%%sql
SELECT column_name,
       length(column_name) AS len,
       encode(column_name::bytea, 'escape') AS escaped
FROM information_schema.columns
WHERE table_name = 'transactions_main'
ORDER BY ordinal_position;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
6 rows affected.

[('transaction_id', 14, 'transaction_id'),
 ('customer_id', 11, 'customer_id'),
 ('order_date', 10, 'order_date'),
 ('delivery_date', 13, 'delivery_date'),
 ('grand_total', 11, 'grand_total'),
 ('invoice_status', 14, 'invoice_status')]

In [14]:
%%sql

SELECT *
FROM customers
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('RS001', 'PT Prasetyo (Persero) Tbk Hospital', 'Hospital', 'Tira Riyanti', '+628523912448', 46),
 ('RS002', 'UD Hastuti Maryadi Tbk Hospital', 'Hospital', 'Jarwa Pudjiastuti', '+628687100882', 28),
 ('RS003', 'PD Andriani Hospital', 'Hospital', 'Umar Iswahyudi', '+628429463558', 34),
 ('RS004', 'UD Hutagalung (Persero) Tbk Hospital', 'Hospital', 'H. Gantar Mandasari', '+628320463011', 41),
 ('RS005', 'Perum Hariyah Purnawati Hospital', 'Hospital', 'Bahuraksa Latupono, M.M.', '+628128740939', 43)]

In [9]:
%%sql

SELECT *
FROM master_products
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('MED-C001', 'Syringe 10ml', 'Consumable', 4482.0, 0.0, 482312.0),
 ('MED-C002', 'N95 Mask', 'Consumable', 1421.0, 0.0, 138719.0),
 ('MED-C003', 'Catheter 16G', 'Consumable', 285.0, 0.0, 415322.0),
 ('MED-C004', 'Nitrile Gloves L', 'Consumable', 2745.0, 0.0, 269159.0),
 ('MED-C005', 'Gauze 10x10cm', 'Consumable', 3765.0, 0.0, None)]

In [10]:
%%sql

SELECT *
FROM transactions_item
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'Consumable', 'MED-C010', 'Cotton Bud 100s', 623516.0, 462.0, 288064168.0, 'No'),
 ('TRX001', 'Consumable', 'MED-C011', 'Surgical Tape 5cm', 496995.0, 49.0, 24352744.0, 'No'),
 ('TRX002', 'Device', 'MED-D116', 'Medtronic Pacemaker', 23900020.0, 217.0, 5186304366.0, 'No'),
 ('TRX003', 'Consumable', 'MED-C013', 'NaCl 0.9% 500ml', 825323.0, 53.0, 43742130.0, 'No'),
 ('TRX004', 'Consumable', 'MED-C014', 'Dextrose 5% 1000ml', 105844.0, 119.0, 12595462.0, 'No')]

In [11]:
%%sql

SELECT *
FROM transactions_main
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'RS038', datetime.date(2025, 10, 1), datetime.date(2025, 10, 27), 312416912.0, 'Completed'),
 ('TRX002', 'RS028', datetime.date(2025, 7, 11), datetime.date(2025, 8, 5), 5186304366.0, 'Completed'),
 ('TRX003', 'RS044', datetime.date(2025, 8, 19), datetime.date(2025, 9, 10), 43742130.0, 'Sent to Tax'),
 ('TRX004', 'RS034', datetime.date(2025, 4, 19), datetime.date(2025, 5, 7), 7460548176.0, 'Sent to Tax'),
 ('TRX005', 'RS042', datetime.date(2025, 8, 24), datetime.date(2025, 9, 12), 18284399302.0, 'Completed')]

After Modification

In [12]:
%%sql

SELECT *
FROM master_products
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('MED-C001', 'Syringe 10ml', 'Consumable', 4482, 0, 482312),
 ('MED-C002', 'N95 Mask', 'Consumable', 1421, 0, 138719),
 ('MED-C003', 'Catheter 16G', 'Consumable', 285, 0, 415322),
 ('MED-C004', 'Nitrile Gloves L', 'Consumable', 2745, 0, 269159),
 ('MED-C005', 'Gauze 10x10cm', 'Consumable', 3765, 0, None)]

In [15]:
%%sql

SELECT *
FROM customers
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('RS001', 'PT Prasetyo (Persero) Tbk Hospital', 'Hospital', 'Tira Riyanti', '+628523912448', 46),
 ('RS002', 'UD Hastuti Maryadi Tbk Hospital', 'Hospital', 'Jarwa Pudjiastuti', '+628687100882', 28),
 ('RS003', 'PD Andriani Hospital', 'Hospital', 'Umar Iswahyudi', '+628429463558', 34),
 ('RS004', 'UD Hutagalung (Persero) Tbk Hospital', 'Hospital', 'H. Gantar Mandasari', '+628320463011', 41),
 ('RS005', 'Perum Hariyah Purnawati Hospital', 'Hospital', 'Bahuraksa Latupono, M.M.', '+628128740939', 43)]

In [22]:
%%sql

SELECT *
FROM transactions_item
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'Consumable', 'MED-C010', 'Cotton Bud 100s', 623516, 462, Decimal('288064168'), 'No', None),
 ('TRX001', 'Consumable', 'MED-C011', 'Surgical Tape 5cm', 496995, 49, Decimal('24352744'), 'No', None),
 ('TRX002', 'Device', 'MED-D116', 'Medtronic Pacemaker', 23900020, 217, Decimal('5186304366'), 'No', None),
 ('TRX003', 'Consumable', 'MED-C013', 'NaCl 0.9% 500ml', 825323, 53, Decimal('43742130'), 'No', None),
 ('TRX004', 'Consumable', 'MED-C014', 'Dextrose 5% 1000ml', 105844, 119, Decimal('12595462'), 'No', None)]

In [37]:
%%sql

SELECT *
FROM transactions_main
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('TRX001', 'RS038', datetime.date(2025, 10, 1), datetime.date(2025, 10, 27), 818622734.0, 'Completed'),
 ('TRX002', 'RS028', datetime.date(2025, 7, 11), datetime.date(2025, 8, 5), 21359405049.0, 'Completed'),
 ('TRX003', 'RS044', datetime.date(2025, 8, 19), datetime.date(2025, 9, 10), 2164434358.0, 'Sent to Tax'),
 ('TRX004', 'RS034', datetime.date(2025, 4, 19), datetime.date(2025, 5, 7), 39084468533.0, 'Sent to Tax'),
 ('TRX005', 'RS042', datetime.date(2025, 8, 24), datetime.date(2025, 9, 12), 99970933.0, 'Completed')]

In [42]:
%%sql

SELECT *
FROM transactions_item
WHERE inden_status LIKE '% YES %'
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
0 rows affected.

[]

In [16]:
%%sql

SELECT 
    mp.product_code,
    mp.product_name,
    mp.inden_lead_time_days,
    mp.stock_available,
    ti.inden_est_time_days
FROM master_products as mp
JOIN transactions_item as ti USING (product_code)
WHERE ti.inden_flag = 'Yes'
LIMIT 5;

 * postgresql+psycopg2://postgres:***@localhost:5432/medsupply
5 rows affected.

[('SVC-J002', 'MRI Annual Service', 21, 1686, 21),
 ('SVC-J010', 'Endoscope Training', 21, 4341, 21),
 ('MED-D119', 'Getinge Anesthesia', 30, 4721, 30),
 ('MED-D107', 'Zoll Defibrillator', 21, 980, 21),
 ('SVC-J004', 'Defib Training', 7, 154, 7)]